PetyC/H7-Mode/2.Firmware/STM32H743_Esp/User/Drive/LCD/bsp_Demo.h
/*
 * @Description: 
 * @Autor: Pi
 * @Date: 2022-08-18 18:50:27
 * @LastEditTime: 2022-08-22 17:02:04
 */
#ifndef BSP_LCD_H
#define BSP_LCD_H

#include <string.h>
#include "main.h"
#include "stm32h7xx.h"
#include "spi.h"

/*SPI句柄*/
#define SPI_HANDLE (hspi1)
extern SPI_HandleTypeDef SPI_HANDLE;

/*DMA句柄*/
#define DMA_HANDLE (hdma_spi1_tx)
extern DMA_HandleTypeDef DMA_HANDLE;

/*TIM句柄*/
#define TIM_HANDLE (htim1)
extern TIM_HandleTypeDef TIM_HANDLE;
#define TIM_CHANNEL   TIM_CHANNEL_1



/*是否使用FreeRTOS*/
#define USE_FreeRTOS  0

/*IO操作*/
#define LCD_RES_Low()   LCD_RES_GPIO_Port->BSRR = (uint32_t)LCD_RES_Pin << 16U
#define LCD_RES_High()  LCD_RES_GPIO_Port->BSRR = LCD_RES_Pin

#define LCD_DC_Low()    LCD_DC_GPIO_Port->BSRR = (uint32_t)LCD_DC_Pin << 16U  
#define LCD_DC_High()   LCD_DC_GPIO_Port->BSRR = LCD_DC_Pin    

/*屏幕分辨率*/
#define X_MAX_PIXEL	        128
#define Y_MAX_PIXEL	        128

/*显示方向 0~3*/
#define USE_HORIZONTAL 2

/*LCD功能设置*/
void Bsp_LCD_Init(void);
void Bsp_LCD_Reset(void);
void Bsp_LCD_BacklightPct(uint8_t pct);

/*绘图功能*/
void Bsp_LCD_SetRegion(uint16_t x_start, uint16_t y_start, uint16_t x_end, uint16_t y_end);
void Bsp_LCD_SetXY(uint16_t x, uint16_t y);
void Bsp_LCD_DrawPoint(uint16_t x, uint16_t y, uint16_t Data);

void Bsp_LCD_FullColor(uint16_t Color);
void Bsp_LCD_DisplayImages(uint16_t *Images);


/*SPI驱动相关*/
void Bsp_LCD_SPI_SET8B(void);
void Bsp_LCD_SPI_SET16B(void);
void Bsp_LCD_DMA_SetMemInc(uint8_t Enable);

void Bsp_LCD_SendData_16B(uint16_t data);
void Bsp_LCD_SendData_8B(uint8_t data);
void Bsp_LCD_SendCmd_16B(uint16_t data);
void Bsp_LCD_SendCmd_8B(uint8_t data);
void Bsp_LCD_SendData(uint8_t *data, uint16_t len);
void Bsp_LCD_Send_DMA(uint8_t *data, uint16_t len);

#endif
